[
    {
        "filename": "PXL_20211002_165433604_1024.jpg",
        "description": "Rebuilding my new entryway. Wish I had a before picture! The previous entryway had a concrete section and an old falling apart wood deck with railing."
    },
    {
        "filename": "PXL_20211006_181810972_1024.jpg",
        "description": "After demolishing my old deck, there was 3+ feet that needed to be filled in with rock. Many many wheelbarrows of crushed rock. Very sore the next day!"
    },
    {
        "filename": "PXL_20211021_211147809_1024.jpg",
        "description": "Rock is in and starting to put in rebar."
    },
    {
        "filename": "PXL_20211021_211159755_1024.jpg",
        "description": "Rock and rebar in different angle."
    },
    {
        "filename": "PXL_20211021_211207425_1024.jpg",
        "description": "Rock and rebar in yet another angle."
    },
    {
        "filename": "PXL_20211029_165615188_1024.jpg",
        "description": "Got a friend of a friend who works in concrete to help pour this 'small project'. It started to rain so we had to tarp it up. Pretty stressful because it could have messed up the surface."
    },
    {
        "filename": "PXL_20211103_175716575_1024.jpg",
        "description": "Demolishing my old deck and hot tub in the backyard. The deck was in pretty bad condition."
    },
    {
        "filename": "PXL_20211103_175721065_1024.jpg",
        "description": "Another angle showing the old deck. Lots of wood and hot tub material to remove."
    },
    {
        "filename": "PXL_20211103_175728658_1024.jpg",
        "description": "Caught Doug in the reflection who's pointing out that I should take a photo of the house siding damage that needed to be fixed."
    },
    {
        "filename": "PXL_20211103_175731425_1024.jpg",
        "description": "The hot tub was sagging because the concrete footing shifted."
    },
    {
        "filename": "PXL_20211103_175736562_1024.jpg",
        "description": "More decking to take out."
    },
    {
        "filename": "PXL_20211103_182135914_1024.jpg",
        "description": "Evaluating the damage to house siding. Not looking good, yikes..."
    },
    {
        "filename": "PXL_20211103_182145478_1024.jpg",
        "description": "Luckily the only rot was on the siding, which Doug replaced!"
    },
    {
        "filename": "PXL_20211103_192503387_1024.jpg",
        "description": "Tearing apart the hot tub and cover with a sawzall. Pretty fun but took quite a while."
    },
    {
        "filename": "PXL_20211103_192506562_1024.jpg",
        "description": "Boards pulled from the deck and the first tree that we will remove. Notice the old fence falling apart in the background."
    },
    {
        "filename": "PXL_20211103_192509141_1024.jpg",
        "description": "Sawing the hot tub apart was pretty effective. I wasn't sure how to remove it before Doug mentioned we could just saw it chunks."
    },
    {
        "filename": "PXL_20211105_165518068_1024.jpg",
        "description": "Found that the gutter drain pipe had pulled apart. Doug fixed it by cutting some of the old pipe away and replacing with new parts from Home Depot."
    },
    {
        "filename": "PXL_20211105_165520990_1024.jpg",
        "description": "Erosion got pretty deep, yikes!"
    },
    {
        "filename": "PXL_20211106_183459373_1024.jpg",
        "description": "Starting to put together the handrail for the new concrete entryway. Doug had the foresight to put bolts into the concrete so no new holes needed to be drilled. Worked great!"
    },
    {
        "filename": "PXL_20211108_154238598_1024.jpg",
        "description": "More 4x4 boards put up, starting to take shape."
    },
    {
        "filename": "PXL_20211108_154246250_1024.jpg",
        "description": "Another angle with all 4x4 boards up."
    },
    {
        "filename": "PXL_20211115_172822148_1024.jpg",
        "description": "Pulled off siding that was rotting. Luckily no rot made it's way to the foundation!"
    },
    {
        "filename": "PXL_20211115_172828025_1024.jpg",
        "description": "Only superficial rot luckily."
    },
    {
        "filename": "PXL_20211115_172831871_1024.jpg",
        "description": "Took extra pictures in case I needed to file a home owner's claim."
    },
    {
        "filename": "PXL_20211120_200110825_1024.jpg",
        "description": "The initial framing for the new concrete patio. Lot's of crushed rock from leftovers of front entryway. We poured a concrete retaining wall on the left using deck boards and leftovers (while it was snowing! Picture is after snow melted of course.). I decided to go with a concrete patio / deck combo so that crawl space vents were not blocked."
    },
    {
        "filename": "PXL_20211120_200117944_1024.jpg",
        "description": "Piping pulled from hot tub, parts the tree that was removed, and deck leftovers."
    },
    {
        "filename": "PXL_20211120_200123798_1024.jpg",
        "description": "Used tarps to help with mud from path. Used the side of the house for material storage."
    },
    {
        "filename": "PXL_20211120_200129962_1024.jpg",
        "description": "Lots of material to dispose of. Ended up getting a temporary dumpster and filled it to the brim with wet decking and all the left over material."
    },
    {
        "filename": "PXL_20211127_190646850_1024.jpg",
        "description": "I handled priming and painting the handrail. Coated many times to make it rot resistant. We used Trex baluster rods - I think it turned out nicely!"
    },
    {
        "filename": "PXL_20211127_190655611_1024.jpg",
        "description": "Handrail coming together. In the back you can see where my broken rain gutter was staining the concrete. Doug was able to fix it and I used vinegar to remove rust spot."
    },
    {
        "filename": "PXL_20211127_190702883_1024.jpg",
        "description": "Another angle, backside is looking nice."
    },
    {
        "filename": "PXL_20211129_172624166_1024.jpg",
        "description": "Handrail is now complete, nice and sturdy! Notice the bushes that were in front of those tall windows are now gone."
    },
    {
        "filename": "PXL_20211129_172631040_1024.jpg",
        "description": "Another angle of the finished handrail."
    },
    {
        "filename": "PXL_20211201_172011102_1024.jpg",
        "description": "Started putting in rebar. Drilled into concrete foundation and used an epoxy stuff to glue it in."
    },
    {
        "filename": "PXL_20211201_172020761_1024.jpg",
        "description": "Lots of rebar, this thing is going nowhere!"
    },
    {
        "filename": "PXL_20211201_172027499_1024.jpg",
        "description": "Eventually decided to remove that chunk of concrete on the left, but not until last minute. You can see the huge pile of decking in the background."
    },
    {
        "filename": "PXL_20211201_172031127_1024.jpg",
        "description": "Lots of clean up needed."
    },
    {
        "filename": "PXL_20211205_162449343_1024.jpg",
        "description": "Now back to the front yard to start removing some arborvitae on the left side of the house. Lots and lots of roots and rocks. Dug out stumps and used Doug's winch to yank them out. You can see the old fencing and gate that fell off."
    },
    {
        "filename": "PXL_20220203_234845608_1024.jpg",
        "description": "Started the process of removing chunks of my front lawn. What a painstakingly slow process. Couldn't just put the chunks of grass into compost bin, had to wash off the dirt (to put in compost bin). On each chunk. Took forever! You can see the new fencing and gate in the background. Steel posts, cedar planks, and pressure treated framework."
    },
    {
        "filename": "PXL_20220203_234911787_1024.jpg",
        "description": "This used to be full of ivy that was completely overgrown. I pulled it all, roots and all, out over the course of a few days."
    },
    {
        "filename": "PXL_20220203_234919530_1024.jpg",
        "description": "So much ivy was removed!"
    },
    {
        "filename": "PXL_20220203_234924443_1024.jpg",
        "description": "Removed 3 to 4 overgrown plants and an old tree which really opened up the front. Starting to rip up grass. So much to rip up, wash and dispose of."
    },
    {
        "filename": "PXL_20220203_234934884_1024.jpg",
        "description": "During the process of determining what the new front would look like I found that my property line was NOT where I thought it was. Turns out my yard is smaller and didn't in fact go all the way to the bushes. My back fence was not even on my property, yikes!"
    },
    {
        "filename": "PXL_20220211_200741608_1024.jpg",
        "description": "All the grass removed, front yard on left side is started to take shape. We graded it so that water would run where we wanted it to. You can see the piles of rocks that we pulled out on the left. The neighbor LOVES rocks and most had made there way to my side."
    },
    {
        "filename": "PXL_20220211_200748524_1024.jpg",
        "description": "Starting to rip out the bushes from the right side as well as grass. You can see the top side was starting to take shape."
    },
    {
        "filename": "PXL_20220211_200756937_1024.jpg",
        "description": "Transplanted some daffodils, looks pretty good."
    },
    {
        "filename": "PXL_20220211_200809426_1024.jpg",
        "description": "Lots of work todo on this side still."
    },
    {
        "filename": "PXL_20220211_200812537_1024.jpg",
        "description": "Another angle of all the remaining work."
    },
    {
        "filename": "PXL_20220223_195201424_1024.jpg",
        "description": "Found the property marker and am trying to determine what to do with the bushes that are over the line."
    },
    {
        "filename": "PXL_20220223_202253688_1024.jpg",
        "description": "Some of the front bushes are removed and the dirt is piling up."
    },
    {
        "filename": "PXL_20220223_202258642_1024.jpg",
        "description": "Starting to transplant the four yellow/green bushes."
    },
    {
        "filename": "PXL_20220223_202306344_1024.jpg",
        "description": "Lots of yard debris, took many months to depose of it all in the compost bin."
    },
    {
        "filename": "PXL_20220225_183043806_1024.jpg",
        "description": "Had to build a drain to funnel water near my house out to the side. "
    },
    {
        "filename": "PXL_20220225_183048977_1024.jpg",
        "description": "Most of the water will drain into a rock bed."
    },
    {
        "filename": "PXL_20220225_183057915_1024.jpg",
        "description": "Removed the fencing and rotting gate. You can see the wood pile that we started from all the trees that were taken out."
    },
    {
        "filename": "PXL_20220225_183108879_1024.jpg",
        "description": "Another angle of the new drain piping."
    },
    {
        "filename": "PXL_20220227_170043245_1024.jpg",
        "description": "Removed a lot of bricks from the front yard that were around my mailbox. Used a sledge hammer to break them up to use as fill for the patio base."
    },
    {
        "filename": "PXL_20220227_191611901_1024.jpg",
        "description": "Bushes, grass and all other things have been removed, starting to take shape."
    },
    {
        "filename": "PXL_20220227_191615083_1024.jpg",
        "description": "Bushes were successfully transplanted near the property line AND they lived and are doing well!"
    },
    {
        "filename": "PXL_20220227_191627782_1024.jpg",
        "description": "Used the Sawzall to cut through roots of some of the bigger bushes. Getting really tired of roots."
    },
    {
        "filename": "PXL_20220306_201718225_1024.jpg",
        "description": "Used the same friend of a friend to pour the concrete patio. He used a concrete pump, instead of wheelbarrows, and just pumped it right in."
    },
    {
        "filename": "PXL_20220306_201729012_1024.jpg",
        "description": "Looking pretty good!"
    },
    {
        "filename": "PXL_20220306_201750938_1024.jpg",
        "description": "Front yard is almost grass free now, really shaping up nicely."
    },
    {
        "filename": "PXL_20220306_201756088_1024.jpg",
        "description": "We setup a drain at the corner so used the pipe to ship it to the side of the property. Took quite a while to get the angle correct so the water would flow correctly. You can also see here were Doug added a rain gutter clean out. He did it for all the rain gutter drains all around my house."
    },
    {
        "filename": "PXL_20220306_201806290_1024.jpg",
        "description": "Lots of roots to deal with. Daffodils are starting to bloom."
    },
    {
        "filename": "PXL_20220306_201820078_1024.jpg",
        "description": "Daffodils are looking pretty nice!"
    },
    {
        "filename": "PXL_20220306_201838454_1024.jpg",
        "description": "Lots of cleaning dirt of chunks of grass. Water everywhere!"
    },
    {
        "filename": "PXL_20220306_201841603_1024.jpg",
        "description": "Still a mound of grass to go. Left over chunks of concrete from backyard patio."
    },
    {
        "filename": "PXL_20220307_181909603_1024.jpg",
        "description": "Right side of front yard starting to take shape."
    },
    {
        "filename": "PXL_20220318_192922802_1024.jpg",
        "description": "Trex starting to take shape!"
    },
    {
        "filename": "PXL_20220323_165742145_1024.jpg",
        "description": "Called in tree crew to top tree next to my house. It was much cheap to top the tree and have Doug and I remove the rest."
    },
    {
        "filename": "PXL_20220404_212803879_1024.jpg",
        "description": "Doug starting to install the stacked rock decorative retaining wall."
    },
    {
        "filename": "PXL_20220406_191459039_1024.jpg",
        "description": "New wall is looking nice!"
    },
    {
        "filename": "PXL_20220408_200049490_1024.jpg",
        "description": "Another angle of wall."
    },
    {
        "filename": "PXL_20220408_200114565_1024.jpg",
        "description": "First wall is almost complete."
    },
    {
        "filename": "PXL_20220409_191118003_1024.jpg",
        "description": "Looking good but maybe a little taller..."
    },
    {
        "filename": "PXL_20220409_191131286_1024.jpg",
        "description": "That tree is really in the way of my new wall! Maybe I should take it out..."
    },
    {
        "filename": "PXL_20220409_191142989_1024.jpg",
        "description": "First wall complete, starting on second wall above it."
    },
    {
        "filename": "PXL_20220410_195719584_1024.jpg",
        "description": "Second wall coming along."
    },
    {
        "filename": "PXL_20220410_195742099_1024.jpg",
        "description": "Second wall looking good!"
    },
    {
        "filename": "PXL_20220413_202731670_1024.jpg",
        "description": "Time to put up a new fence. Used steel posts instead of 4x4 cedar posts. Can see the arborvitae that we had to work around which made it way more challenging."
    },
    {
        "filename": "PXL_20220413_202735587_1024.jpg",
        "description": "Front facing fence is looking good!"
    },
    {
        "filename": "PXL_20220413_202745517_1024.jpg",
        "description": "Can see the pile of fencing yet to go up."
    },
    {
        "filename": "PXL_20220415_175839521_1024.jpg",
        "description": "Of course it's always raining so had to deal with mud all the time. Here we setup a path to help deal with it."
    },
    {
        "filename": "PXL_20220415_175855145_1024.jpg",
        "description": "Front fence looking into backyard."
    },
    {
        "filename": "PXL_20220415_175908220_1024.jpg",
        "description": "Side of the fence. Had to deal with a significant slope and lots of mud! Extremely slippery and dangerous. Luckily no one was hurt."
    },
    {
        "filename": "PXL_20220415_181033710_1024.jpg",
        "description": "Concrete patio and deck area still needs work."
    },
    {
        "filename": "PXL_20220415_181037778_1024.jpg",
        "description": "Magnolia tree in the background."
    },
    {
        "filename": "PXL_20220415_181057348_1024.jpg",
        "description": "Lots of old cedar fencing to dispose of. Luckily I was able to use the compost bin for a lot of it."
    },
    {
        "filename": "PXL_20220415_190237224_1024.jpg",
        "description": "Doug put together the new gate inside my garage."
    },
    {
        "filename": "PXL_20220417_161437329_1024.jpg",
        "description": "Removed our plywood walkway so it can dry up a little. Can see my daffodils are done for the year!"
    },
    {
        "filename": "PXL_20220417_161453157_1024.jpg",
        "description": "Gate is installed."
    },
    {
        "filename": "PXL_20220417_161502465_1024.jpg",
        "description": "Frame of fence is up and now we are putting up cedar planks."
    },
    {
        "filename": "PXL_20220417_161515804_1024.jpg",
        "description": "Making decent progress. Can see how solid the new fence is!"
    },
    {
        "filename": "PXL_20220417_161523355_1024.jpg",
        "description": "Starting to roll out weed barrier matting on the remaining front yard."
    },
    {
        "filename": "PXL_20220421_190733386_1024.jpg",
        "description": "We topped the tree in the front of my house that was blocking the view of my new wall. Doug is pretty good at taking out trees and this was no exception. You can see where it was ripping up the concrete with it's roots."
    },
    {
        "filename": "PXL_20220421_190653582_1024.jpg",
        "description": "Doug cut notches in the top so it would be easier to use the wedges."
    },
    {
        "filename": "PXL_20220421_190756286_1024.jpg",
        "description": "Front yard is looking good without that big tree blocking everything."
    },
    {
        "filename": "PXL_20220422_180050639_1024.jpg",
        "description": "You can see the chunks being cut off, most are rotten and come off easily."
    },
    {
        "filename": "PXL_20220422_180214021.PORTRAIT_1024.jpg",
        "description": "I had a city arborist come out and he said that the tree did need to go because it was basically rotten on the inside. Here you can see the worms going to town on it."
    },
    {
        "filename": "PXL_20220422_180512649.PORTRAIT_1024.jpg",
        "description": "The center is totally rotten."
    },
    {
        "filename": "PXL_20220422_192926716.PORTRAIT_1024.jpg",
        "description": "After a lot of chainsawing, using the maddox, and sledge hammer and wedges we were able to fully remove the huge stump and root system! Whew!"
    },
    {
        "filename": "PXL_20220421_190857977_1024.jpg",
        "description": "Front fence and gate looking good. Can see we have weed barrier down too."
    },
    {
        "filename": "PXL_20220421_190923756_1024.jpg",
        "description": "Completed fence looks solid!"
    },
    {
        "filename": "PXL_20220421_190947003_1024.jpg",
        "description": "Backside of front gate and fencing."
    },
    {
        "filename": "PXL_20220421_191000485_1024.jpg",
        "description": "Side fence looking great! So much wood to cut and screw in, whew!"
    },
    {
        "filename": "PXL_20220429_170445154_1024.jpg",
        "description": "The left side of my front yard. We set it up so that water drains correctly. Not sure what I will plant there but kinda differently looking."
    },
    {
        "filename": "PXL_20220429_170410430_1024.jpg",
        "description": "My fancy new front yard! Got the bark delivered and took about two days to spread it all out. Kinda feels like a new coat of paint! Which I will actually probably do this summer. I painted a bit of my house to cover up some marks and realized it's not too bad actually, so will do it myself most likely."
    }
]